In [8]:
import pandas as pd

In [12]:
#Exercício 1
dicD = {
    'ID':[1,2,3,4,5,6],
    'Nomes':['Alice','Julia','Bruna','Daniel','Felipe','Silvio'],
    'Idade':[19,22,28,34,28,48],
    'Profissões':['Direito','Engenharia','Enfermeira','Engenheiro Civil','Cientista da Computação','Engenheiro Eletrônico']
    
}
label01 = ['Primeira','Segunda','Terceira','Quarta','Quinta','Sexta']

In [15]:
df = pd.DataFrame(dicD)

In [16]:
df.head()

   ID   Nomes  Idade               Profissões
0   1   Alice     19                  Direito
1   2   Julia     22               Engenharia
2   3   Bruna     28               Enfermeira
3   4  Daniel     34         Engenheiro Civil
4   5  Felipe     28  Cientista da Computação

In [17]:
#Exercício 2
dicD2 = {
    'Número de Produtos Fabricados':[50,30,40,100],
    'Setores':[1,2,3,4],
    
}
label02 = ['Primeira','Segunda']

In [18]:
df2 = pd.DataFrame(dicD2)

In [20]:
df2.head()

   Número de Produtos Fabricados  Setores
0                             50        1
1                             30        2
2                             40        3
3                            100        4

In [27]:
#Exercício 3
dicD3 = {
    'ID':[1,2,3,4],
    'Nome':['Ana','Pedro','Maria','João'],
    'Setores':['RH','Vendas','Administrativo','Produção']
    
}
dicD4 = {
    'ID':[1,2,3,4],
    'Salários':[3000,2800,3200,2500]
}

In [28]:
df3 = pd.DataFrame(dicD3)
df4 = pd.DataFrame(dicD4)

In [29]:
df_n1 = pd.merge(df3,df4,how='inner', on='ID')

In [30]:
df_n1.head()

   ID   Nome         Setores  Salários
0   1    Ana              RH      3000
1   2  Pedro          Vendas      2800
2   3  Maria  Administrativo      3200
3   4   João        Produção      2500

In [34]:
#Exercício 4
dicD5 = {
    'Data':["01-01-2023","01-02-2023","01-03-2023"],
    'Produto':["Item A","Item B","Item A"],
    'Quantidade':[10,5,8],
    'Valor':[100.00,50.00,80.00]
    
}
dicD6 = {
    'Data':["01-02-2023","02-02-2023","03-02-2023"],
    'Produto':["Item C","Item B","Item D"],
    'Quantidade':[12,6,3],
    'Valor':[120.00,60.00,30.00]
}

In [35]:
df5 = pd.DataFrame(dicD5)
df6 = pd.DataFrame(dicD6)

In [36]:
df5.head()

         Data Produto  Quantidade  Valor
0  01-02-2023  Item C          12  120.0
1  02-02-2023  Item B           6   60.0
2  03-02-2023  Item D           3   30.0

In [37]:
df6.head()

         Data Produto  Quantidade  Valor
0  01-02-2023  Item C          12  120.0
1  02-02-2023  Item B           6   60.0
2  03-02-2023  Item D           3   30.0